#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```
terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/zemoso-int/tf-devops-zemoso-vpn-infra/runs/run-AEbfogLwPLPvccXZ

Waiting for the plan to start...

Terraform v0.15.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_subnet.z_sec_private_subnet will be created
  + resource "aws_subnet" "z_sec_private_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-2"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.20.30.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Created_by" = "suraj"
          + "Name"       = "z-sec-private-subnet"
          + "Owner"      = "terraform"
        }
      + tags_all                        = {
          + "Created_by" = "suraj"
          + "Name"       = "z-sec-private-subnet"
          + "Owner"      = "terraform"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.z_sec_public_subnet will be created
  + resource "aws_subnet" "z_sec_public_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-2"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.20.20.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Created_by" = "suraj"
          + "Name"       = "z-sec-public-subnet"
          + "Owner"      = "terraform"
        }
      + tags_all                        = {
          + "Created_by" = "suraj"
          + "Name"       = "z-sec-public-subnet"
          + "Owner"      = "terraform"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.z_sec_vpc will be created
  + resource "aws_vpc" "z_sec_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.20.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = false
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Created_by" = "suraj"
          + "Name"       = "z-sec-vpc"
          + "Owner"      = "terraform"
        }
      + tags_all                         = {
          + "Created_by" = "suraj"
          + "Name"       = "z-sec-vpc"
          + "Owner"      = "terraform"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @suraj-zemoso, Action: `pull_request`*